simpleCRUD_RubyOnRails/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
      @articles = Article.all #baris ini melakukan request akan semua list dari Article yang tersimpan di database yang nantinya dapat digunakan dalam view  index

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    #render plain: params[:article].inspect #baris ini akan mengembalikan langsung kembalian parameter params dalam bentuk plain text
    #@article = params[:article] #baris ini akan mengeset variabel @article yang nantinya bisa dipakai/dikirim keview (view/articles/create)
    ##############============================
    #@article = Article.new(params[:article])# baris ini akan menyebabkan error "Active Model", yang dikarenakan salah satu atribut yang harus ada
    # sehigga dapat diperbaiki menjadi
    #@article =  Article.new(params.require(:article).permit(:title,:text))
    #Baris kode diatas juga dianggap kurang baik untuk mengindari pemanggilan dari luar, sehigga dilakukan pendefenisian di luar method yaitu article_params

    @article = Article.new(article_params)

    #@article.save #baris ini akan menyimpan parameter kedalam database
    #perlu ada pengecekan terhadap disimpan atau tidaknya, sehingga hal tersebut dapat dilakukan melalui baris kode berikut.
        if @article.save #bernilai benar jika berhasik menyimpan

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @article = Article.find(params[:id]) #baris ini akan memparsing data dari id yang akan di edit

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
      @article = Article.find(params[:id]) #baris ini akan mengambil parameter dari database berdasarkan parameter dari id

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 6]]
---
  def destroy
    #fungsi ini akan menjalankan penghapusan dari database.
    #hal ini dilakukan dengan destroy terhadao object yang diketahui.

    @article = Article.find(params[:id]) #baris ini akan set value dari id ke @article.
    @article.destroy #baris ini akan melakukan  destroy terhadap object tersebut